src/cf/InformationRegisters/ЯндексДоставка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЯндексДоставка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладСлужбыДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыСлужбДоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнтервалыДоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оформлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЯндексДоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмененЛокально</Name>
					<Comment>Время локального изменения, UTC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЯндексДоставка/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СвойстваЗаказа(Знач ЗаказПокупателя) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЗаказа", "");
	Результат.Вставить("НомерЗаказа", "");
	Результат.Вставить("Статус", Перечисления.СтатусыЯндексДоставки.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат Результат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЯндексДоставка.ИдентификаторЗаказа,
	|	ЯндексДоставка.НомерЗаказа,
	|	ЯндексДоставка.Статус
	|ИЗ
	|	РегистрСведений.ЯндексДоставка КАК ЯндексДоставка
	|ГДЕ
	|	ЯндексДоставка.ЗаказПокупателя = &ЗаказПокупателя");
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСвойстваЗаказа(Знач ЗаказПокупателя, Знач СпособОтгрузки, Знач Свойства) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.ИдентификаторЗаказа = Свойства["id"];
	МенеджерЗаписи.НомерЗаказа = Свойства["full_num"];
	МенеджерЗаписи.СпособОтгрузки = СпособОтгрузки;
	МенеджерЗаписи.Статус = ЯндексДоставкаКлиентСервер.СтатусПоКоду(Свойства["status"]);
	МенеджерЗаписи.ИзмененЛокально = ТекущаяУниверсальнаяДата();
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ОбновитьСтатусЗаказа(Знач ЗаказПокупателя, Знач Статус) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УстановитьОтметкуИзмененЛокально(Знач ЗаказПокупателя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
	МенеджерЗаписи.ИзмененЛокально = ТекущаяУниверсальнаяДата();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
